app/views/home/index.html.erb

SELECT "meatcuts".* FROM "meatcuts"
SELECT "techniques".* FROM "techniques"
---
	<%= form_for(meatcuts_path) do %>
	<h3>I have a <%= select("meatcut", "name", Meatcut.all.collect {|m| [ m.name.capitalize, m.id ] }, {include_blank: 'Select a cut of meat'}) %><br>
	and I want to <%= select("technique", "name", Technique.all.collect {|m| [ m.name.capitalize, m.id ] }, {include_blank: 'Select a cooking technique'}) %>