app/views/match/index.html.erb

			<h3>
				I have a <%= select("meatcut", "name", @beefcuts.all.collect {|m| [ m.name.capitalize, m.id ] }.sort, {include_blank: 'Select a cut of beef'}) %>
			<br>
				and I want to <%= select("technique", "name", Technique.all.collect {|m| [ m.name.capitalize, m.id ] }.sort, {include_blank: 'Select a cooking technique'}) %> <br>
---
SELECT "meatcuts".* FROM "meatcuts"
SELECT "techniques".* FROM "techniques"