app/controllers/home_controller.rb

	def index
		@meatcuts = Meatcut.all
---
SELECT "meatcuts".* FROM "meatcuts"