app/controllers/match_controller.rb

SELECT "meatcuts".* FROM "meatcuts"  WHERE "meatcuts"."animal" = 'pig'
SELECT "techniques".* FROM "techniques"
---
	def index
		@beefcuts = Meatcut.where(:animal => "cow")
    @porkcuts = Meatcut.where(:animal => "pig")
    @chickencuts = Meatcut.where(:animal => "chicken")
		@techniques = Technique.all

SELECT  "meatcuts".* FROM "meatcuts"  WHERE "meatcuts"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "techniques".* FROM "techniques"  WHERE "techniques"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "meatcuts".* FROM "meatcuts" INNER JOIN "matches" ON "meatcuts"."id" = "matches"."meatcut_id" WHERE "matches"."technique_id" = $1  [["technique_id", 2]]
SELECT "matches".* FROM "matches"  WHERE "matches"."meatcut_id" = $1  [["meatcut_id", 1]]
SELECT  "techniques".* FROM "techniques" INNER JOIN "matches" ON "techniques"."id" = "matches"."technique_id" WHERE "matches"."meatcut_id" = $1  ORDER BY "techniques"."id" ASC LIMIT 1  [["meatcut_id", 9]]
SELECT "matches".* FROM "matches"  WHERE "matches"."meatcut_id" = 1 AND "matches"."technique_id" = 1
---
  def answer
    if params[:meatcut][:name] != '' && params[:technique][:name] != ''
      @meatcut = Meatcut.find(params[:meatcut][:name])
      @technique = Technique.find(params[:technique][:name])
      @matches = @meatcut.matches
    elsif params[:meatcut][:name] == '' && params[:technique][:name] != ''
      @technique = Technique.find(params[:technique][:name])
      meatcuts = []
      @technique.meatcuts.each { |m| meatcuts << m }
      @meatcut = meatcuts.sample
      @matches = @meatcut.matches
    elsif params[:meatcut][:name] != '' && params[:technique][:name] == ''
      @meatcut = Meatcut.find(params[:meatcut][:name])
      techniques = []
      @meatcut.techniques.each { |t| techniques << t }

SELECT "meatcuts".* FROM "meatcuts"  WHERE "meatcuts"."animal" = 'cow'
---
	def matchme
    @beefcuts = Meatcut.where(:animal => "cow")

SELECT  "meatcuts".* FROM "meatcuts"  WHERE "meatcuts"."id" = $1 LIMIT 1  [["id", 9]]
---
  def automatch
    @meatcut = Meatcut.find(params[:meatcut][:name])