app/controllers/meatcuts_controller.rb

  def index
    @meatcuts = Meatcut.all
    @beefcuts = Meatcut.where(:animal => "cow")
---
SELECT "meatcuts".* FROM "meatcuts"
SELECT "meatcuts".* FROM "meatcuts"  WHERE "meatcuts"."animal" = 'cow'

    def set_meatcut
      @meatcut = Meatcut.find(params[:id])
---
SELECT  "meatcuts".* FROM "meatcuts"  WHERE "meatcuts"."id" = $1 LIMIT 1  [["id", 1]]