app/controllers/techniques_controller.rb

  def index
    @techniques = Technique.all
    @dry = Technique.where(:dry => "true")
---
SELECT "techniques".* FROM "techniques"
SELECT "techniques".* FROM "techniques"  WHERE "techniques"."dry" = 'true'